{
    "conf_int": [
        {
            "title_s": [
                "Best Heuristic Identification for Constraint Satisfaction"
            ],
            "abstract_s": [
                "In constraint satisfaction problems, the variable ordering heuristic takes a central place by selecting the variables to branch on during backtrack search. As many hand-crafted branching heuristics have been proposed in the literature, a key issue is to identify, from a pool of candidate heuristics, which one is the best for solving a given constraint satisfaction task. Based on the observation that modern constraint solvers are using restart sequences, the best heuristic identification problem can be cast in the context of multi-armed bandits as a non-stochastic best arm identification problem. Namely, during each run of some given restart sequence, the bandit algorithm selects a heuristic and receives a reward for this heuristic before proceeding to the next run. The goal is to identify the best heuristic using few runs, and without any stochastic assumption about the constraint solver. In this study, we propose an adaptive variant of Successive Halving that exploits Luby's universal restart sequence. We analyze the convergence of this bandit algorithm in the non-stochastic setting, and we demonstrate its empirical effectiveness on various constraint satisfaction benchmarks."
            ],
            "conferenceTitle_s": "31st International Joint Conference on Artificial Intelligence (IJCAI'22)",
            "authFullName_s": [
                "Frederic Koriche",
                "Christophe Lecoutre",
                "Anastasia Paparrizou",
                "Hugues Wattez"
            ],
            "halId_s": "hal-03678354",
            "uri_s": "https://hal.archives-ouvertes.fr/hal-03678354v2",
            "page_s": "1859-1865",
            "doiId_s": "10.24963/ijcai.2022/258",
            "publicationDateY_i": 2022,
            "files_s": [
                "https://hal.archives-ouvertes.fr/hal-03678354/file/article_long.pdf"
            ],
            "n": 1
        },
        {
            "title_s": [
                "Perturbing Branching Heuristics in Constraint Solving"
            ],
            "abstract_s": [
                "Variable ordering heuristics are one of the key settings for an efficient constraint solver. During the last two decades, a considerable effort has been spent for designing dynamic heuristics that iteratively change the order of variables as search progresses. At the same time, restart and randomization methods have been devised for alleviating heavy-tailed phenomena that typically arise in backtrack search. Despite restart methods are now well-understood, choosing how and when to randomize a given heuristic remains an open issue in the design of modern solvers. In this paper, we present several conceptually simple perturbation strategies for incorporating random choices in constraint solving with restarts. The amount of perturbation is controlled and learned in a bandit-driven framework under various stationary and non-stationary exploration policies, during successive restarts. Our experimental evaluation shows significant performance improvements for the perturbed heuristics compared to their classic counterpart, establishing the need for incorporating perturbation in modern constraint solvers."
            ],
            "conferenceTitle_s": "26th International Conference on Principles and Practice of Constraint Programming",
            "authFullName_s": [
                "Anastasia Paparrizou",
                "Hugues Wattez"
            ],
            "halId_s": "hal-03096113",
            "uri_s": "https://hal.archives-ouvertes.fr/hal-03096113",
            "doiId_s": "10.1007/978-3-030-58475-7_29",
            "publicationDateY_i": 2020,
            "files_s": [
                "https://hal.archives-ouvertes.fr/hal-03096113/file/final.pdf"
            ],
            "n": 2
        },
        {
            "title_s": [
                "Learning Variable Ordering Heuristics with Multi-Armed Bandits and Restarts"
            ],
            "conferenceTitle_s": "ECAI 2020 - 24th European Conference on Artificial Intelligence",
            "authFullName_s": [
                "Hugues Wattez",
                "Frédéric Koriche",
                "Christophe Lecoutre",
                "Anastasia Paparrizou",
                "Sébastien Tabary"
            ],
            "halId_s": "hal-03096124",
            "uri_s": "https://hal.archives-ouvertes.fr/hal-03096124",
            "doiId_s": "10.3233/FAIA200115",
            "publicationDateY_i": 2020,
            "files_s": [
                "https://hal.archives-ouvertes.fr/hal-03096124/file/1557_paper.pdf"
            ],
            "n": 3
        },
        {
            "title_s": [
                "Refining Constraint Weighting"
            ],
            "abstract_s": [
                "Backtracking search is a complete approach that is traditionally used to solve instances modeled as constraint satisfaction problems. The space explored during search depends dramatically on the order that variables are instantiated. Considering that a perfect variable ordering might result to a backtrack-free search (i.e., finding backdoors, cycle cutsets), finding heuristics for variable ordering has always attracted research interest. For fifteen years, constraint weighting has been shown to be a successful approach for guiding backtrack search. In this paper, we show how the popular generic variable ordering heuristic dom/wdeg can be made more robust by taking finer information at each conflict: the \"current\" arity of the failing constraint as well as the size of the current domains of the variables involved in that constraint. Our experimental results show the practical interest of this refined variant of constraint weighting."
            ],
            "conferenceTitle_s": "ICTAI 2019: IEEE 31st International Conference on Tools with Artificial Intelligence",
            "authFullName_s": [
                "Hugues Wattez",
                "Christophe Lecoutre",
                "Anastasia Paparrizou",
                "Sébastien Tabary"
            ],
            "halId_s": "hal-02414832",
            "uri_s": "https://hal.archives-ouvertes.fr/hal-02414832",
            "doiId_s": "10.1109/ICTAI.2019.00019",
            "publicationDateY_i": 2019,
            "files_s": [
                "https://hal.archives-ouvertes.fr/hal-02414832/file/ictai%2719%20final.pdf"
            ],
            "n": 4
        },
        {
            "title_s": [
                "Data Analytics and Visualization for Connected Objects: A Case Study for Sleep and Physical Activity Trackers"
            ],
            "conferenceTitle_s": "31st International Conference on Industrial Engineering and Other Applications of Applied Intelligent Systems (IEA/AIE'18)",
            "authFullName_s": [
                "Karim Tabia",
                "Hugues Wattez",
                "Nicolas Ydée",
                "Karima Sedki"
            ],
            "halId_s": "hal-03301188",
            "uri_s": "https://hal-univ-artois.archives-ouvertes.fr/hal-03301188",
            "page_s": "685-696",
            "doiId_s": "10.1007/978-3-319-92058-0_66",
            "publicationDateY_i": 2018,
            "files_s": [
                "https://hal-univ-artois.archives-ouvertes.fr/hal-03301188/file/llncs%20preprint.pdf"
            ],
            "n": 5
        }
    ],
    "conf_nat": [
        {
            "title_s": [
                "Exploring AI approaches to improve the resolution of unsplittable multicommodity flow problems in wireless networks"
            ],
            "conferenceTitle_s": "39th Spanish Conference on Statistics and Operation Research (SEIO'22)",
            "authFullName_s": [
                "Sonia Haddad-Vanier",
                "Romain Wallon",
                "Hugues Wattez"
            ],
            "halId_s": "hal-03647245",
            "uri_s": "https://hal.archives-ouvertes.fr/hal-03647245",
            "publicationDateY_i": 2022,
            "n": 6
        },
        {
            "title_s": [
                "Metrics : un unique outil pour l'analyse d'expérimentations"
            ],
            "conferenceTitle_s": "23e Conférence ROADEF de la Société Française de Recherche Opérationnelle et d'Aide à la Décision (ROADEF'22)",
            "authFullName_s": [
                "Thibault Falque",
                "Romain Wallon",
                "Hugues Wattez"
            ],
            "halId_s": "hal-03595329",
            "uri_s": "https://hal.archives-ouvertes.fr/hal-03595329",
            "publicationDateY_i": 2022,
            "files_s": [
                "https://hal.archives-ouvertes.fr/hal-03595329/file/resume.pdf"
            ],
            "n": 7
        },
        {
            "title_s": [
                "Exploration des approches de l'IA pour renforcer la résolution des problèmes de multiflots entiers dans les réseaux énergétiques"
            ],
            "conferenceTitle_s": "23e Conférence ROADEF de la Société Française de Recherche Opérationnelle et d'Aide à la Décision (ROADEF'22)",
            "authFullName_s": [
                "Sonia Haddad-Vanier",
                "Romain Wallon",
                "Hugues Wattez"
            ],
            "halId_s": "hal-03597206",
            "uri_s": "https://hal.archives-ouvertes.fr/hal-03597206",
            "publicationDateY_i": 2022,
            "n": 8
        },
        {
            "title_s": [
                "Focus sur les heuristiques basées sur la pondération de contraintes"
            ],
            "abstract_s": [
                "La recherche avec retour-arrière est une approche complète et traditionnellement utilisée pour la résolution de problèmes de satisfaction et d'optimisation de contraintes. Il est bien connu que l'espace exploré durant la recherche peut drastiquement fluctuer selon l'ordre dans lequel les variables sont instanciées. En considérant que le parfait ordonnancement des variables résulterait en une recherche sans retour-arrière, la recherche d'heuristiques de choix de variables suscite toujours autant l'intérêt des chercheurs. Depuis quinze ans, l'approche basée sur la pondération des contraintes s'est toujours montrée efficace pour guider la recherche. Dans cet article, nous montrons comment les heuristiques génériques de choix de variables wdeg et dom/wdeg ont été rendues plus robustes ces dernières années par un affinement et le vieillissement de l'information extraite à chaque conflit. Nos résultats expérimentaux avec ACE, le nouvel avatar d'AbsCon, montrent le réel intérêt de ces heuristiques revisitées.",
                "Backtracking search is a complete approach that is traditionally used to solve instances modeled as constraint satisfaction or optimization problems. The space explored during search depends dramatically on the order that variables are instantiated. Considering that a perfect variable ordering might result to a backtrack-free search, finding variable ordering heuristics has always attracted research interest. For fifteen years, constraint weighting has been shown to be a successful approach for guiding backtrack search. In this paper, we show how the popular generic variable ordering heuristics dom/wdeg and wdeg have been made more robust these two last years by refining and aging the extracted information at each conflict. Our experimental results with ACE, the new AbsCon avatar, show the practical interest of these revisited constraint weighting heuristics."
            ],
            "conferenceTitle_s": "16es Journées Francophones de Programmation par Contraintes (JFPC’21)",
            "authFullName_s": [
                "Hugues Wattez",
                "Frédéric Koriche",
                "Christophe Lecoutre",
                "Anastasia Paparrizou",
                "Sébastien Tabary"
            ],
            "halId_s": "hal-03449631",
            "uri_s": "https://hal.archives-ouvertes.fr/hal-03449631",
            "publicationDateY_i": 2021,
            "files_s": [
                "https://hal.archives-ouvertes.fr/hal-03449631/file/JFPC_2021_F2.pdf"
            ],
            "n": 9
        },
        {
            "title_s": [
                "Perturbation des heuristiques de branchement dans la résolution de contraintes"
            ],
            "abstract_s": [
                "L'heuristique de choix de variables est l'un des mécanismes clés d'un solveur de contraintes. Au cours des deux dernières décennies, des heuristiques efficaces ont été proposées, adaptant l'ordre des variables au fur et à mesure que la recherche progresse. Dans le même temps, des méthodes de redémarrage et de randomisation ont été conçues pour rendre les solveurs plus robustes. Alors que les méthodes de redémarrage sont maintenant bien comprises, choisir comment et quand randomiser une heuristique donnée reste un problème ouvert. Dans cet article, nous présentons plusieurs stratégies de perturbation conceptuellement simples pour incorporer des choix aléatoires dans la résolution de contraintes avec redémarrages. La quantité de perturbation est contrôlée et apprise par des bandits sous diverses politiques d'exploration (stationnaire ou non stationnaire). L'évaluation expérimentale montre une amélioration significative des performances pour les heuristiques perturbées par rapport à leurs homologues d'origine."
            ],
            "conferenceTitle_s": "16es Journées Francophones de Programmation par Contraintes (JFPC’21)",
            "authFullName_s": [
                "Hugues Wattez",
                "Frederic Koriche",
                "Anastasia Paparrizou"
            ],
            "halId_s": "hal-03449550",
            "uri_s": "https://hal.archives-ouvertes.fr/hal-03449550",
            "publicationDateY_i": 2021,
            "files_s": [
                "https://hal.archives-ouvertes.fr/hal-03449550/file/JFPC_2021_F3.pdf"
            ],
            "n": 10
        },
        {
            "title_s": [
                "Descente Agressive de Borne en Optimisation sous Contraintes"
            ],
            "conferenceTitle_s": "16èmes Journées Francophones de Programmation par Contraintes (JFPC'21)",
            "authFullName_s": [
                "Thibault Falque",
                "Christophe Lecoutre",
                "Bertrand Mazure",
                "Hugues Wattez"
            ],
            "halId_s": "hal-03625476",
            "uri_s": "https://hal-univ-artois.archives-ouvertes.fr/hal-03625476",
            "publicationDateY_i": 2021,
            "files_s": [
                "https://hal-univ-artois.archives-ouvertes.fr/hal-03625476/file/JFPC_2021_A2.pdf"
            ],
            "n": 11
        },
        {
            "title_s": [
                "Metrics : Mission Expérimentations"
            ],
            "abstract_s": [
                "Le développement de solveurs de contraintes s'accompagne nécessairement d'une phase d'expérimentation, permettant d'évaluer les performances des fonctionnalités implantées. Pour chacun des solveurs considérés, il faut alors collecter et analyser des statistisques relatives à leur exécution et qui, le plus souvent, restent les mêmes. Néanmoins, il existe probablement autant de scripts permettant d'extraire ces statistiques et de tracer les figures associées que de chercheurs du domaine. Un outil unifiant et facilitant les analyses de résultats expérimentaux paraît donc nécessaire, notamment pour favoriser le partage et la reproductibilité de ces résultats. Partant de ce constat, nous avons développé la bibliothèque Metrics, dont l'ambition est de fournir une chaîne complète d'outils conçue dans cette optique. Dans cet article, nous présentons cette bibliothèque et illustrons son utilisation en rejouant l'analyse des résultats de la compétition XCSP'19.",
                "Developing constraint solvers comes with the need to perform experiments, in order to evaluate the performance of the implemented features. For each considered solver, one needs to collect and analyze statistics about its execution which, most of the time, remain the same. However, there exist probably as many scripts allowing to extract such statistics and to draw the associated figures as researchers in the domain. A unifying tool making easier the analysis of experimental results seems thus required, especially to favor the sharing and the reproducibility of these results. Based on this observation, we have developed the Metrics library, whose ambition is to provide a complete toolchain designed in that purpose. In this paper, we present this library and illustrate its use through the analysis of the results of the XCSP'19 competition."
            ],
            "conferenceTitle_s": "16es Journées Francophones de Programmation par Contraintes (JFPC’21)",
            "authFullName_s": [
                "Thibault Falque",
                "Romain Wallon",
                "Hugues Wattez"
            ],
            "halId_s": "hal-03295285",
            "uri_s": "https://hal.archives-ouvertes.fr/hal-03295285",
            "publicationDateY_i": 2021,
            "files_s": [
                "https://hal.archives-ouvertes.fr/hal-03295285/file/JFPC_2021_G1.pdf"
            ],
            "n": 12
        },
        {
            "title_s": [
                "Heuristiques de recherche : un bandit pour les gouverner toutes"
            ],
            "abstract_s": [
                "L'automatisation de la configuration des solveurs a reçu une grande attention ces dernières années notam-ment pour la capacité à ajuster ses différents paramètres selon l'instance à résoudre. De plus, cette automatisation évite à l'utilisateur le choix d'une configuration appropriée à chaque instance et ainsi, évite une tâche requérant des qualités d'expert et rend plus accessible les outils de la programmation par contraintes. Les techniques basées sur les portfolios ont été grandement étudiées dans le but de configurer les solveurs de contraintes. Son principe est d'entraîner le solveur à résoudre plusieurs instances afin de trouver la meilleure configuration lors de la résolution d'une instance inconnue. Dans cette étude, nous portons notre attention sur le choix de la meilleure stratégie de recherche, à savoir la meilleure heuristique de choix de variables. Nous proposons une structure algorithmique générique qui optimise la sélection des différentes heu-ristiques de choix de variables grâce à l'apprentissage en ligne, c'est-à-dire sans aucune connaissance apriori. Dans ce but, nous utilisons une technique en apprentissage, appelée les bandits multi-bras, permettant d'automatiser la sélection de l'heuristique la plus appropriée et guidant au mieux la recherche. Nous essayons deux politiques différentes basées sur les bandits multi-bras gérant la proportion d'exploration-exploitation. Une évaluation ex-périmentale démontre que la machine proposée résulte en un solveur plus efficace et stable. Abstract Automating solver's configuration has received a great attention last years as it can adjust the various parameters of a solver to the instance to be solved. In addition, this automation releases the user from choosing the suitable configuration each time, task that requires a great expertise and thus, burdens the widespread of * Papier doctorant : Hugues Wattez 1,2 est auteur principal. constraint programming technology and tools. Portfolio based techniques have been vastly used to configure constraint solvers. The principle of portfolios is to train themselves by solving many instances in advance , in order to find the right combination of parameters of the solver when solving an unknown instance. In this work, we turn our attention to the selection of the best search strategy, namely the best variable ordering. We propose a generic algorithmic framework that selects among several variable ordering heuristics using on-line learning, i.e. without any prior knowledge. For this purpose, we deploy a machine learning technique, called multi-armed bandits, that allows to automatically select the appropriate heuris-tic to guide the search. We tried two different policies for multi-armed bandits that manage the proportion of exploration-exploitation. We make a thorough experimental evaluation that demonstrates that the proposed framework results in a more efficient and stable solver."
            ],
            "conferenceTitle_s": "15es Journées Francophones de Programmation par Contraintes – JFPC 2019",
            "authFullName_s": [
                "Hugues Wattez",
                "Frédéric Koriche",
                "Christophe Lecoutre",
                "Anastasia Paparrizou",
                "Sébastien Tabary"
            ],
            "halId_s": "hal-02414288",
            "uri_s": "https://hal.archives-ouvertes.fr/hal-02414288",
            "publicationDateY_i": 2019,
            "files_s": [
                "https://hal.archives-ouvertes.fr/hal-02414288/file/jfpc19%20final.pdf"
            ],
            "n": 13
        }
    ],
    "workshops": [
        {
            "title_s": [
                "Aggressive Bound Descent for Constraint Optimization"
            ],
            "abstract_s": [
                "Backtrack search is a classical complete approach for exploring the search space of a constraint optimization problem. Each time a new solution is found during search, its associated bound is used to constrain more the problem, and so the remaining search. An extreme (bad) scenario is when solutions are found in sequence with very small differences between successive bounds. In this paper, we propose an aggressive bound descent (ABD) approach to remedy this problem: new bounds are modified exponentially as long as the searching algorithm is successful. We show that this approach can render the solver more robust, especially at the beginning of search. Our experiments confirm this behavior for constraint optimization"
            ],
            "conferenceTitle_s": "Doctoral Program of the 28th International Conference on Principles and Practice of Constraint Programming.",
            "authFullName_s": [
                "Thibault Falque",
                "Christophe Lecoutre",
                "Bertrand Mazure",
                "Hugues Wattez"
            ],
            "halId_s": "hal-03749141",
            "uri_s": "https://hal.archives-ouvertes.fr/hal-03749141",
            "publicationDateY_i": 2022,
            "files_s": [
                "https://hal.archives-ouvertes.fr/hal-03749141/file/paper.pdf"
            ],
            "n": 14
        },
        {
            "title_s": [
                "Metrics: Towards a Unified Library for Experimenting Solvers"
            ],
            "abstract_s": [
                "When developing a SAT solver, one of the most important parts is to perform experiments so as to evaluate its performance. Most of the time, this process remains the same, so that everybody collects almost the same statistics about the solver execution. However, how many scripts are there to retrieve experimental data and draw scatter or cactus plots? Probably as many as researchers in the domain. Based on this observation, this paper introduces Metrics, a Python library, aiming to unify and make easier the analysis of solver experiments. The ambition of Metrics is to provide a complete toolchain from the execution of the solver to the analysis of its performance. In particular, this library simplifies the retrieval of experimental data from many different inputs (including the solver's output), and provides a nice interface for drawing commonly used plots, computing statistics about the execution of the solver, and effortlessly organizing them (e.g., in Jupyter notebooks). In the end, the main purpose of Metrics is to favor the sharing and reproducibility of experimental results and their analysis."
            ],
            "conferenceTitle_s": "11th International Workshop on Pragmatics of SAT (POS'20)",
            "authFullName_s": [
                "Thibault Falque",
                "Romain Wallon",
                "Hugues Wattez"
            ],
            "halId_s": "hal-03301303",
            "uri_s": "https://hal-univ-artois.archives-ouvertes.fr/hal-03301303",
            "publicationDateY_i": 2020,
            "files_s": [
                "https://hal-univ-artois.archives-ouvertes.fr/hal-03301303/file/paper.pdf"
            ],
            "n": 15
        }
    ],
    "others": [
        {
            "title_s": [
                "Solveurs de Contraintes Autonomes",
                "Autonomous Constraint Solvers"
            ],
            "abstract_s": [
                "La programmation par contraintes est déclarative : l'utilisateur modélise le problème (sous forme de contraintes) sans se soucier de la partie résolution. La résolution est déléguée à un programme générique appelé solveur de contraintes. Les solveurs de contraintes utilisent des mécanismes issus de l'intelligence artificielle pour guider ses choix (heuristiques), et pour réduire efficacement l'espace de recherche (inférence). Les solveurs de contraintes récents sont équipés de plusieurs heuristiques. Le choix de la meilleure heuristique pour résoudre une instance de problème donnée est actuellement délégué à l'utilisateur. L'objectif de cette thèse est de rendre les solveurs de contraintes plus autonomes. Nous voulons enlever toute charge cognitive à l'utilisateur concernant le processus de résolution. Pendant la recherche de solutions, le solveur redémarre régulièrement la recherche pour éviter les impasses coûteuses. Nous proposons de sélectionner automatiquement l'heuristique la plus prometteuse après chaque redémarrage. En réponse à ce problème de choix séquentiel, nous nous inspirons des politiques traitant du problème du bandit multi-bras. De telles politiques sont issues de l'apprentissage par renforcement et permettent d'explorer un ensemble d'actions tout en exploitant, le plus souvent possible, l'action la plus prometteuse. Après avoir défini comment incorporer cet outil d'apprentissage automatique dans un solveur, nous proposons plusieurs applications pour rendre les solveurs de contraintes modernes plus autonomes. Premièrement, nous appliquons les politiques proposées dans la littérature sur les bandits multi-bras pour apprendre la meilleure heuristique parmi un ensemble d'heuristiques fournies par le solveur. Sur la base de cette première application, nous proposons une nouvelle politique qui est plus cohérente avec la structure des solveurs actuels. Toujours en utilisant des politiques de bandit, nous proposons d'adapter la quantité d'aléa nécessaire pour perturber une heuristique donnée et la rendre plus efficace. Enfin, nous étendons ces résultats aux solveurs de contraintes sous optimisation.",
                "Constraint programming is declarative: the user models the problem (in the form of constraints) without worrying about the solving part. The solving is delegated to a generic program called a constraint solver. Constraint solvers use mechanisms from artificial intelligence to guide its choices (heuristics), and to efficiently reduce the search space (inference). Recent constraint solvers are equipped with several heuristics. Choosing the best heuristic to solve a given problem instance is currently delegated to the user. The goal of this thesis is to make constraint solvers more autonomous. We want to remove any cognitive burden from the user regarding the solving process. While searching for solutions, the solver often restarts the search to avoid expensive dead-ends. We propose to automatically select the most promising heuristic after each restart. In response to this sequential choice problem, we take inspiration from policies addressing the multi-armed bandit problem. Such policies are derived from reinforcement learning and allow to explore a set of actions while exploiting the most profitable one as often as possible. After having defined how to incorporate this machine learning tool in a solver, we propose several applications to make modern constraint solvers more autonomous. First, we apply the policies proposed in the multi-armed-bandits literature to learn the best heuristic among a set of heuristics provided by the solver. Based on this first application, we propose a new policy that is more consistent with the structure of current solvers. Still using bandit policies, we propose to adapt the amount of randomization needed to perturb a given heuristic and make it more efficient. Finally, we extend these results to constraint optimization solvers."
            ],
            "authFullName_s": [
                "Hugues Wattez"
            ],
            "halId_s": "tel-03648917",
            "uri_s": "https://hal-univ-artois.archives-ouvertes.fr/tel-03648917",
            "publicationDateY_i": 2021,
            "files_s": [
                "https://hal-univ-artois.archives-ouvertes.fr/tel-03648917/file/these_light.pdf"
            ],
            "n": 16
        }
    ],
    "refs": {
        "hal-03678354": 1,
        "hal-03096113": 2,
        "hal-03096124": 3,
        "hal-02414832": 4,
        "hal-03301188": 5,
        "hal-03647245": 6,
        "hal-03595329": 7,
        "hal-03597206": 8,
        "hal-03449631": 9,
        "hal-03449550": 10,
        "hal-03625476": 11,
        "hal-03295285": 12,
        "hal-02414288": 13,
        "hal-03749141": 14,
        "hal-03301303": 15,
        "tel-03648917": 16
    }
}